# ProfileFlippedHor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ProfileFlippedHor Property
ParameterTypeId Class See Also
---
"Profile Is Flipped"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ProfileFlippedHor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProfileFlippedHor As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ProfileFlippedHor {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace